package mvc.java.kadai.se.cat02.sec01_algorithm.no016;

/**
 * Javaアルゴリズム問題16
 */
public class Algorithm16 {

	public static void main(String[] args) {

		// ■ 実行結果の通りにコンソールに出力されるプログラムを作成しましょう。

		// ①「横幅」×「高さ」で構成された四角形を「*」で表示し、「個数」の数だけ、横に並べて表示するプログラムを作成しましょう。
		//    なお、各四角形の間は、スペース1つとします。変数xに「5」(横幅)、yに「3」(高さ)、zに「4」(個数)を代入し
		//    x,y,zを用いてプログラムを作成してください。
		//    ⇒【実行結果】
		//    ***** ***** ***** *****
		//    ***** ***** ***** *****
		//    ***** ***** ***** *****

		// ---------- ①解答 start ----------
		int x = 5;
		int y = 3;
		int z = 4;
		for(int i = 0; i < y; i++) {
			for(int j = 0; j < z; j++) {
				System.out.print("*".repeat(x)+ " ");
			}
			System.out.println();
		}


		// ---------- ①解答 end ----------

		System.out.println();
		System.out.println("===================================");

		// ② ①で作成したプログラムの変数値を「x=4」「y=5」「x=6」に変更した場合、
		//    以下実行結果通りに表示されるか確認しましょう。
		//    ⇒【実行結果】
		//    **** **** **** **** **** ****
		//    **** **** **** **** **** ****
		//    **** **** **** **** **** ****
		//    **** **** **** **** **** ****
		//    **** **** **** **** **** ****

		// ---------- ②解答 start ----------
		x = 4;
		y = 5;
		z = 6;
		for(int i = 0; i < y; i++) {
			for(int j = 0; j < z; j++) {
				System.out.print("*".repeat(x)+ " ");
			}
			System.out.println();
		}


		// ---------- ②解答 end ----------

		// ※①と②は変数値を変更する以外のプログラムの差異は認めません。

	}

}
